tests/load/artillery-matching.yml
# Artillery Load Test: Matching API
#
# Tests the matching engine under various load conditions
# Run with: artillery run tests/load/artillery-matching.yml

config:
  target: 'http://localhost:3000' # Change to production URL for prod testing
  phases:
    # Warm-up phase
    - duration: 60
      arrivalRate: 5
      name: 'Warm up'

    # Normal load
    - duration: 180
      arrivalRate: 20
      name: 'Sustained load'

    # Peak load
    - duration: 120
      arrivalRate: 50
      name: 'Peak load'

    # Spike test
    - duration: 60
      arrivalRate: 100
      name: 'Spike'

    # Cool down
    - duration: 60
      arrivalRate: 10
      name: 'Cool down'

  # Performance targets
  ensure:
    maxErrorRate: 1 # Max 1% error rate
    p95: 500 # 95th percentile under 500ms
    p99: 1000 # 99th percentile under 1000ms

  # Plugins
  plugins:
    metrics-by-endpoint:
      stripQueryString: true

scenarios:
  - name: 'Match profile request'
    flow:
      # Get CSRF token
      - get:
          url: '/api/csrf-token'
          capture:
            - json: '$.token'
              as: 'csrfToken'

      # Request matches
      - post:
          url: '/api/match/profile'
          headers:
            Content-Type: 'application/json'
            x-csrf-token: '{{ csrfToken }}'
          json:
            k: 20
          expect:
            - statusCode: 200
            - contentType: json
            - hasProperty: items
          capture:
            - json: '$.items[0].score'
              as: 'topScore'

      # Think time (simulate user reviewing results)
      - think: 3

      # Request with different mode
      - post:
          url: '/api/match/profile'
          headers:
            Content-Type: 'application/json'
            x-csrf-token: '{{ csrfToken }}'
          json:
            k: 10
          expect:
            - statusCode: 200